/**
 * Клас TextProcessor - головний клас, який містить виконавчий метод main,
 * що реалізує пошук та виведення слів заданої довжини у питальних реченнях заданого тексту.
 *
 * @author Taras Vasiliev
 */
public class TextProcessor {
    /**
     * Виконавчий метод, що ініціалізує текст та викликає метод для пошуку слів заданої довжини
     * у питальних реченнях цього тексту.
     *
     * @param args аргументи командного рядка (не використовуються)
     */
    public static void main(String[] args) {
        // Довжина слів, які будуть знайдені у питальних реченнях
        int wordLengthy = 6;
        String inputText3 = "";
        String inputText2 = "waffles waffles?";

        // Текст, з яким ми працюємо. Знаходяться саме слова за довжиною, щось на кшталт "a+t" - не є словом і буде виключатись.
        String inputText = """
                Чи ти вже читав нову книгу, яку я тобі рекомендував? Які фільми ти плануєш подивитися в ці вихідні? Сьогодні надзвичайно гарна погода. Чи подобається тобі гуляти на свіжому повітрі? Вечірка в суботу буде цікавою.""";

        // Створення об'єкта тексту
        Text text = new Text(inputText);

        // Створення об'єкта методів для обробки тексту
        TextMethod textMethod = new TextMethod(text, wordLengthy);

        // Виведення результату на екран
        System.out.println("Дія з текстом за варіантом - В усіх питальних реченнях заданого тексту знайти" +
                "та надрукувати без повторень слова заданої довжини.\n");
        System.out.println("Текст:\n" + inputText + "\n");
        System.out.println(textMethod.getWordsGivenLengthInQuestions());
    }
}
